import { updateLives } from "../components/lives.js";
import { BindTypeWriter } from "../components/typewriter.js";
import { DELAY_BEFORE_CALLBACK, GAME_OVER_QUOTES } from "../constants.js";
import { Engine } from "../engine.js";
import { GameState } from "../state.js";

class GameOverScreen {
  /**
   * @param {Element} root
   * @param {Engine} engine
   * */
  constructor(root, engine) {
    this.root = root;
    this.engine = engine;
  }
  callback() {
    BindTypeWriter({ querySelection: ".typewriter", speed: 0.45 });
    BindTypeWriter({
      querySelection: ".typewriter2",
      speed: 0.65,
      delay: 600,
    });
    BindTypeWriter({
      querySelection: ".typewriter3",
      speed: 0.85,
      delay: 800,
    });
    BindTypeWriter({
      querySelection: ".typewriter4",
      speed: 10,
      delay: 1500,
    });

    /** @type {HTMLButtonElement} */
    const button = document.querySelector(".continue-button");

    button.onclick = () => {
      // TODO: haz que el usuario vaya al ultimo nivel"
      updateLives(3);

      this.engine.handleStateUpdate(GameState.INSTRUCTIONS);
    };
  }
  render() {
    // TODO: agregar fade staggering
    const screen = `<div class="h-screen bg-black flex items-center pr-12" style="gap: 18rem;">
<pre class="font-semibold typewriter" style="font-size: 0.8rem; margin-top: -6rem; height: 100vh">
                       uuuuuuuuuuuuuuuuuuuuu.
                   .u$$$$$$$$$$$$$$$$$$$$$$$$$$W.
                 u$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$Wu.
               $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$i
              $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
             $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
           .i$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$i
           $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$W
          .$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$W
         .$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$i
         #$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$.
         W$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
$u       #$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$~
$#      "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
$i        $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
$$        #$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
$$         $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
#$.        $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$#
 $$      $iW$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$!
 $$i      $$$$$$$#"" """#$$$$$$$$$$$$$$$$$#""""""#$$$$$$$$$$$$$$$W
 #$$W    $$$#"            "       !$$$$$           "#$$$$$$$$$$#
  $$$                      ! !iuW$$$$$                 #$$$$$$$#
  #$$    $u                  $   $$$$$$$                  $$$$$$$~
   "#    #$$i.               #   $$$$$$$.                 $$$$$$
          $$$$$i.                """#$$$$i.               .$$$$#
          $$$$$$$$!         .       $$$$$$$$$i           $$$$$
          $$$$$  $iWW   .uW        #$$$$$$$$$W.       .$$$$$$#
            "#$$$$$$$$$$$$#          $$$$$$$$$$$iWiuuuW$$$$$$$$W
               !#""    ""             $$$$$$$##$$$$$$$$$$$$$$$$
          i$$$$    .                   !$$$$$$ .$$$$$$$$$$$$$$$#
         $$$$$$$$$$                    $$$$$$$$$Wi$$$$$$#"#$$
         #$$$$$$$$$W.                   $$$$$$$$$$$#   
          $$$$##$$$$!       i$u.  $. .i$$$$$$$$$#""
             "     #W       $$$$$$$$$$$$$$$$$$$      u$#
                            W$$$$$$$$$$$$$$$$$$      $$$$W
                            $$!$$$##$$$$$$$$      $$$$!
                           i$" $$$$  $$#"  """     W$$$$
                                                   W$$$$!
                      uW$$  uu  uu.  $$$  $$$Wu#   $$$$$$
                     ~$$$$iu$$iu$$$uW$$! $$$$$$i .W$$$$$$
             ..  !   "#$$$$$$$$$$##$$$$$$$$$$$$$$$$$$$$#"
             $$W  $     "#$$$$$$$iW$$$$$$$$$$$$$$$$$$$$$W
             $#          ""#$$$$$$$$$$$$$$$$$$$$$$$$$$$
                              !$$$$$$$$$$$$$$$$$$$$$#
                              $$$$$$$$$$$$$$$$$$$$$$!
                            $$$$$$$$$$$$$$$$$$$$$$$
                             $$$$$$$$$$$$$$$$$$$$"
		  </pre>

		  <div>
		  <pre class="typewriter2">
 ██░ ██  ▄▄▄       ▄████▄   ██ ▄█▀▓█████ ▓█████▄     ▄▄▄▄ ▓██   ██▓
▓██░ ██▒▒████▄    ▒██▀ ▀█   ██▄█▒ ▓█   ▀ ▒██▀ ██▌   ▓█████▄▒██  ██▒
▒██▀▀██░▒██  ▀█▄  ▒▓█    ▄ ▓███▄░ ▒███   ░██   █▌   ▒██▒ ▄██▒██ ██░
░▓█ ░██ ░██▄▄▄▄██ ▒▓▓▄ ▄██▒▓██ █▄ ▒▓█  ▄ ░▓█▄   ▌   ▒██░█▀  ░ ▐██▓░
░▓█▒░██▓ ▓█   ▓██▒▒ ▓███▀ ░▒██▒ █▄░▒████▒░▒████▓    ░▓█  ▀█▓░ ██▒▓░
 ▒ ░░▒░▒ ▒▒   ▓▒█░░ ░▒ ▒  ░▒ ▒▒ ▓▒░░ ▒░ ░ ▒▒▓  ▒    ░▒▓███▀▒ ██▒▒▒ 
 ▒ ░▒░ ░  ▒   ▒▒ ░  ░  ▒   ░ ░▒ ▒░ ░ ░  ░ ░ ▒  ▒    ▒░▒   ░▓██ ░▒░ 
 ░  ░░ ░  ░   ▒   ░        ░ ░░ ░    ░    ░ ░  ░     ░    ░▒ ▒ ░░  
 ░  ░  ░      ░  ░░ ░      ░  ░      ░  ░   ░        ░     ░ ░     
                  ░                       ░               ░░ ░     
		  </pre>
		  <pre class="typewriter3">
 ▄▀▀▄ █  ▄▀▀▄▀▀▀▄  ▄▀▀▀▀▄   ▄▀▀▄ ▀▄  ▄▀▀▀▀▄   ▄▀▀▀▀▄ 
█  █ ▄▀ █   █   █ █      █ █  █ █ █ █      █ █ █   ▐ 
▐  █▀▄  ▐  █▀▀█▀  █      █ ▐  █  ▀█ █      █    ▀▄   
  █   █  ▄▀    █  ▀▄    ▄▀   █   █  ▀▄    ▄▀ ▀▄   █  
▄▀   █  █     █     ▀▀▀▀   ▄▀   █     ▀▀▀▀    █▀▀▀   
█    ▐  ▐     ▐            █    ▐             ▐      
▐                          ▐                         
		  </pre>

	<p style="margin-bottom: 2rem; margin-top: 2.5rem; max-width: 24rem; font-size: 0.9rem;" class="typewriter4">
	${GAME_OVER_QUOTES[Math.floor(Math.random() * GAME_OVER_QUOTES.length)]}
	</p>
		  <button class="continue-button game-over-fade">Reintentar</button> 
		  </div>

		  </div>`;

    this.root.innerHTML = screen;

    setTimeout(() => this.callback(), DELAY_BEFORE_CALLBACK);
  }
}

export { GameOverScreen };
